boardgame-reviews/app/Http/Controllers/PhotoController.php

    public function index()
    {
        $photos = Photo::with(['owner'])->orderBy(Photo::CREATED_AT, 'desc')->paginate();
---
select * from `photos` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `photos`