boardgame-reviews/app/Http/Controllers/ShopController.php

SELECT * FROM `photos` WHERE `photos`.`shop_id` in (2, 3)
SELECT * FROM `shops` ORDER BY `created_at` DESC LIMIT 20 offset 0
SELECT count(*) as aggregate FROM `shops`
---
    public function index()
    {
        $shops = Shop::with(['photos', 'likes'])->orderBy(Shop::CREATED_AT, 'desc')->paginate();

INSERT into `shops` (`bussiness_hours`, `shop_name`, `address`, `updated_at`, `created_at`) values ('10', 'JELLY JELLY CAFE新宿', '新宿', '2020-02-05 22:20:21', '2020-02-05 22:20:21')
INSERT into `photos` (`id`, `filename`, `shop_id`, `updated_at`, `created_at`) values ('r-293jjzsj3a', 'r-293jjzsj3a.jpeg', '2', '2020-02-05 22:20:21', '2020-02-05 22:20:21')
---
            // $shop->address = $request->address;
            clock()->info("{$shop}が logに出ています！");
            clock()->info("{$request}が logに出ています！");
            $shop->fill($request->all())->save();
            // shopに登録後、紐づくphotoをsave
            // $shop->save();
            $photo->shop_id = $shop->id;
            $shop->photos()->save($photo);

SELECT * FROM `photos` WHERE `photos`.`shop_id` in (3)
SELECT * FROM `reviews` WHERE `reviews`.`shop_id` in (3) ORDER BY `id` DESC
SELECT * FROM `shops` WHERE `id` = '3' LIMIT 1
---
    public function show(string $id)
    {
        $shop = Shop::where('id', $id)->with(['photos', 'reviews.author', 'likes'])->first();